terraform plan:

```
Terraform will perform the following actions:

  # module.slack-to-intercom-app.aws_iam_policy.slack_to_intercom_policy will be created
  + resource "aws_iam_policy" "slack_to_intercom_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Lambda Role for slack-to-intercom-app Slack to Intercom app"
      + id               = (known after apply)
      + name             = "slack-to-intercom-app-slack-to-intercom-iam-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-2:460282733690:secret:app/slack-to-intercom-app/secrets*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:us-east-2:460282733690:log-group:/aws/lambda/slack-to-intercom-app_handler_main:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "slack-to-intercom-app-slack-to-intercom-iam-policy"
        }
      + tags_all         = {
          + "Name" = "slack-to-intercom-app-slack-to-intercom-iam-policy"
        }
    }

  # module.slack-to-intercom-app.aws_iam_role.slack_to_intercom_iam_role will be created
  + resource "aws_iam_role" "slack_to_intercom_iam_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for slack-to-intercom-app Slack to Intercom app"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "slack-to-intercom-app-slack-to-intercom-iam-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "slack-to-intercom-app-slack-to-intercom-iam-role"
        }
      + tags_all              = {
          + "Name" = "slack-to-intercom-app-slack-to-intercom-iam-role"
        }
      + unique_id             = (known after apply)
    }

  # module.slack-to-intercom-app.aws_iam_role_policy_attachment.lambda_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "slack-to-intercom-app-slack-to-intercom-iam-role"
    }

  # module.slack-to-intercom-app.aws_lambda_function.handlers["main"] will be created
  + resource "aws_lambda_function" "handlers" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "slack-to-intercom-app_handler_main"
      + handler                        = "lambda.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + s3_bucket                      = "wistia-internal-slack-to-intercom-us-east-2"
      + s3_key                         = "slack-to-intercom-app/lambda/lambda-function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "cost-center" = "slack-to-intercom-app"
        }
      + tags_all                       = {
          + "cost-center" = "slack-to-intercom-app"
        }
      + timeout                        = 29
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SECRET_NAME" = "app/slack-to-intercom-app/secrets"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # module.slack-to-intercom-app.aws_lambda_function_url.url_handlers["main"] will be created
  + resource "aws_lambda_function_url" "url_handlers" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "slack-to-intercom-app_handler_main"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # module.slack-to-intercom-app.aws_lambda_permission.allow_function_url_execution["main"] will be created
  + resource "aws_lambda_permission" "allow_function_url_execution" {
      + action                 = "lambda:InvokeFunctionUrl"
      + function_name          = "slack-to-intercom-app_handler_main"
      + function_url_auth_type = "NONE"
      + id                     = (known after apply)
      + principal              = "*"
      + statement_id           = "AllowLambdaFunctionUrlExecution"
      + statement_id_prefix    = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```